# Tidy Data

> Leo Tolstoy said "Happy families are all alike; every unhappy family is unhappy in its own way."<br />
> "Like families," Hadley Wickham said in his [Tidy Data](http://vita.had.co.nz/papers/tidy-data.html) Paper, "tidy datasets are all alike but every messy dataset is messy in its own way."<br />


**Key components of tidy data**

| Component | Why Necessary |
|:-----------|:---------------|
| Data is tabular | Exploration, Modeling |
| One value per cell | Exploration, Modeling |
| Each observation is one and only one row | Exploration, Modeling |
| Each variable is one and only one column | Exploration |

If a dataset does not meet these requirements, then it is an untidy dataset. 

We will now examine the 4 cases of untidy data. 

<hr style="border:2px solid gray">

## Data is Tabular

Tabular data is needed for exploration and modeling. 

An example of non-tabular data would be the text file, "curriculum_access.txt", that contains the following access logs of the web development curriculum:

```
2018-03-06 13:35:21 html-css/forms 132 23 97.105.19.61
2018-03-06 13:35:23 slides/inheritance_and_polymorphism 29 22 97.105.19.61
2018-03-06 13:35:41 html-css/forms 130 23 97.105.19.61
2018-03-06 13:36:14 java-ii 19 22 97.105.19.61
2018-03-06 13:36:16 java-ii/inheritance-and-polymorphism 19 22 97.105.19.61
2018-03-06 13:36:17 slides/inheritance_and_polymorphism 19 22 97.105.19.61
2018-03-06 13:36:19 java-ii/inheritance-and-polymorphism 35 22 97.105.19.61
```

To make this tabular, we can use string methods that will split this data into columns that represent the various variables that exist in this data.

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import acquire

logs_list = ['2018-03-06 13:35:21 html-css/forms 132 23 97.105.19.61', 
             '2018-03-06 13:35:23 slides/inheritance_and_polymorphism 29 22 97.105.19.61', 
             '2018-03-06 13:35:41 html-css/forms 130 23 97.105.19.61',
             '2018-03-06 13:36:14 java-ii 19 22 97.105.19.61',
             '2018-03-06 13:36:16 java-ii/inheritance-and-polymorphism 19 22 97.105.19.61',
             '2018-03-06 13:36:17 slides/inheritance_and_polymorphism 19 22 97.105.19.61',
             '2018-03-06 13:36:19 java-ii/inheritance-and-polymorphism 35 22 97.105.19.61']
logs_series = pd.Series(logs_list)
logs_series.str.split(expand=True)

,0,1,2,3,4,5
0,2018-03-06,13:35:21,html-css/forms,132,23,97.105.19.61
1,2018-03-06,13:35:23,slides/inheritance_and_polymorphism,29,22,97.105.19.61
2,2018-03-06,13:35:41,html-css/forms,130,23,97.105.19.61
3,2018-03-06,13:36:14,java-ii,19,22,97.105.19.61
4,2018-03-06,13:36:16,java-ii/inheritance-and-polymorphism,19,22,97.105.19.61
5,2018-03-06,13:36:17,slides/inheritance_and_polymorphism,19,22,97.105.19.61
6,2018-03-06,13:36:19,java-ii/inheritance-and-polymorphism,35,22,97.105.19.61

Now, we meet the first requirement of tidy data. We have tabular data! 

<hr style="border:2px solid gray">

## One Value Per Cell

The following table has multiple values in the City_State_Zip column. We will want to split that column into 3 different variables so that we can use one, all, some, or none of the variables in our analysis and modeling.

In [2]:
# create dataframe representing the untidy data

untidy_df = pd.DataFrame({'Customer_ID': ['001', '002', '003'], 
                   'City_State_Zip': ['Dallas, TX, 75205', 'San Antonio, TX, 78209', 'Bend, OR, 97701']
                  })

untidy_df

  Customer_ID          City_State_Zip
0         001       Dallas, TX, 75205
1         002  San Antonio, TX, 78209
2         003         Bend, OR, 97701

Split the column into multiple columns, and name those columns.

In [5]:
# split the column into multiple columns
new_vars = untidy_df.City_State_Zip.str.split(pat=',', expand=True)

# rename the columns
new_vars.columns = ['City', 'State', 'Zip']

new_vars

          City State     Zip
0       Dallas    TX   75205
1  San Antonio    TX   78209
2         Bend    OR   97701

Now, we need to concatenate the new columns to the original dataframe and drop the original column.

In [6]:
# Concatenate new columns to the original dataframe
untidy_df = pd.concat([untidy_df, new_vars], axis=1)

# drop the original column
tidy_df = untidy_df.drop(columns=['City_State_Zip'])

tidy_df

  Customer_ID         City State     Zip
0         001       Dallas    TX   75205
1         002  San Antonio    TX   78209
2         003         Bend    OR   97701

Now, we meet the second requirement of tidy data. We have one variable per column!

<hr style="border:2px solid gray">

## Each row is one and only one observation

An observation is the level at which you want to analyze your data and/or make predictions. 

For example: 
- When making predictions on housing prices, an observation is a single property (property id). 
- When predicting whether or not a customer will churn, an observation is a customer (customer id). 
- When predicting student success in school, an observation is a student (student id). 
- When predicting whether a passenger will survive the titanic, an observation is a passenger (passenger id). 
- When analyzing customer reviews of products, an observation is a review (review id). 

When the data from an observation is scattered across multiple rows, then it is difficult to explore and impossible to model. 

Datasets that are untidy in this way are often referred to as **tall datasets**. 

Here is some *fictional* data on Codeup students.

In [7]:
import env

def get_connection(db, user=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'
    
untidy_df = pd.read_sql('SELECT * FROM students', 
                        env.get_connection('tidy_data'))

untidy_df.head()

         date                 var          val
0  2019-02-04   n_late_from_break     4.028120
1  2019-02-04  coffee_consumption  5255.409740
2  2019-02-04      classroom_temp    67.000000
3  2019-02-05   n_late_from_break     2.101998
4  2019-02-05  coffee_consumption  8603.704719

Notice that the `var` column contains several different variable names, and the `val` column contains the values corresponding to each. Here we would be better off with seperate columns for `n_late_from_break`, `coffee_consumption`, and `classroom_temp` were seperate columns, as they are seperate variables.

Using pandas, we can make this happen in a couple ways:

- `pivot`
- setting the index and `.unstack`ing

We'll demonstrate both:

In [7]:
untidy_df.pivot(index='date', columns='var').head()

                      val
var        classroom_temp coffee_consumption n_late_from_break
date
2019-02-04           67.0        5255.409740          4.028120
2019-02-05           73.0        8603.704719          2.101998
2019-02-06           81.0        1801.498050          4.941244
2019-02-07           62.0        9282.959741          1.419342
2019-02-08           72.0        7558.270659          1.808919

When doing this manipulation, pandas creates a `MultiIndex` for our rows and columns. In our case this isn't helping us out at all, so we can get rid of it to make working with the resulting data frame easier.

In [9]:
def tidy_cols(untidy_df, index_cols):
    # split the var column into multiple variables
    tidy_df = untidy_df.pivot(index='date', columns='var')

    # drop the 'val' index level of the dataframe returned
    tidy_df.columns = tidy_df.columns.droplevel()

    # change the 'var' index name given to the columns to an empty space
    tidy_df.columns.name = ''

    # reset the index so that date is in the body of the dataframe
    tidy_df = tidy_df.reset_index()
    return tidy_df

         date  classroom_temp  coffee_consumption  n_late_from_break
0  2019-02-04            67.0         5255.409740           4.028120
1  2019-02-05            73.0         8603.704719           2.101998
2  2019-02-06            81.0         1801.498050           4.941244
3  2019-02-07            62.0         9282.959741           1.419342
4  2019-02-08            72.0         7558.270659           1.808919

Now we meet the third requirement of tidy data. Each observation is in one and only one row. 

<hr style="border:2px solid gray">

## Each variable is one and only one column

When a single variable spans multiple columns, exploring data becomes very difficult. An example of a single variable spanning multiple columns are dummy variables. For example, when you created dummy variables from the titanic column of `embarked`, you created 3 new columns `embarked_southamption`, `embarked_sherbourg`, `embarked_queenstown`. This is an example of one variable spanning multiple columns. 

When you go into modeling and you have categorical variables, you will need to violate the component of "each variable is one and only one column" due to this need for dummy variables. But for exploration, you will want your data to be tidy. 

`pd.melt()` is the function to use when you need to tidy "wide" data like this.

In [ ]:
untidy_df = pd.read_sql('SELECT * FROM sales', acquire.get_connection('tidy_data'))

untidy_df.head()

We will need to "melt" this in two parts. First, we will do the sales. Next, we will do the PPU data. Finally, we will join the two dataframes together on product and year. We want our final data frame to have the columns product, year, sales, and ppu. 

A melt will combine multiple columns into two columns. There are 3 key parameters when melting:

- `id_vars`: Which vars should *not* be melted. If omitted, all the columns in the data frame will be melted together.
- `var_name`: The name of the column that will hold the names of the of the columns that will be combined.
- `value_name`: The name of the column that will hold the resulting values.

In our example above, the `id_vars` should be `product`, as we *don't* want to combine this column with any others. However, we will be combining the `2016 Sales`, `2017 Sales`, and `2018 Sales` columns into one. `var_name` will be `year` as "year" describes the column names of the columns we are combining, which will be the contents of the new column, and the `value_name` will be `sales`, as that is what the numerical values are.

In [16]:
# select the sales columns
sales_df = untidy_df[['Product', '2016 Sales', '2017 Sales', '2018 Sales']]

# rename columns in the way we want it represented as categories in the "year" column. 
sales_df.columns = ['product', '2016', '2017', '2018']

# melt the data into 3 columns: product, year, and sales
sales_df = sales_df.melt(id_vars=['product'],
                         var_name='year',
                         value_name='sales')

sales_df

   product  year  sales
0        A  2016    673
1        B  2016    259
2        C  2016    644
3        D  2016    508
4        A  2017    231
5        B  2017    748
6        C  2017    863
7        D  2017    356
8        A  2018    173
9        B  2018    186
10       C  2018    632
11       D  2018    347

In [17]:
# select the ppu columns
ppu_df = untidy_df[['Product', '2016 PPU', '2017 PPU', '2018 PPU']]

# rename columns to be the years
ppu_df.columns = ['product', '2016', '2017', '2018']

# melt the data into 3 columns: product, year and ppu
ppu_df = ppu_df.melt(id_vars=['product'], var_name='year', value_name='ppu')

# merge the sales_df and ppu_df on product and year
tidy_df = pd.merge(sales_df, ppu_df, on=['product', 'year'])
tidy_df

   product  year  sales  ppu
0        A  2016    673    5
1        B  2016    259    3
2        C  2016    644    3
3        D  2016    508    9
4        A  2017    231    7
5        B  2017    748    5
6        C  2017    863    5
7        D  2017    356   11
8        A  2018    173    9
9        B  2018    186    8
10       C  2018    632    5
11       D  2018    347   14

## Further Reading

- [Hadley Wickham's Paper on Tidy Data](http://vita.had.co.nz/papers/tidy-data.html)
- [pandas docs: reshaping and pivot tables](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html)

## Exercises

Do your work for this exercise in a jupyter notebook or python script named `tidy_data`. Save this work in your `classification-exercises` repo. Add, commit, and push your changes.

1. Attendance Data

    Read the data from the `attendance` table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.
    
    You should end up with something like this:

        name
        Billy    0.5250
        Jane     0.6875
        John     0.9125
        Sally    0.7625
        Name: grade, dtype: float64

2. Coffee Levels

    1. Read the `coffee_levels` table.
    1. Transform the data so that each carafe is in it's own column.
    1. Is this the best shape for the data?

3. Cake Recipes

    1. Read the `cake_recipes` table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
    1. Tidy the data as necessary.
    1. Which recipe, on average, is the best? recipe b
    1. Which oven temperature, on average, produces the best results? 275
    1. Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

4. **Bonus**: explore the other tables in the `tidy_data` database and reshape them as necessary so that they are in a tidy format.